In [1]:
import pandas as pd
import datetime
import numpy as np

In [3]:
URL = "https://archive.ics.uci.edu/ml/machine-learning-databases/00321/LD2011_2014.txt.zip"

In [4]:
# Download the data and unzip it using Python
import urllib.request
import zipfile
import io

# Download the file from `URL` and save it locally under `file_name`:
urllib.request.urlretrieve(URL, "LD2011_2014.txt.zip")

# Unzip file:
zip_ref = zipfile.ZipFile("LD2011_2014.txt.zip", 'r')
zip_ref.extractall()
zip_ref.close()

In [7]:
# open raw file downloaded to local machine:
raw_file_path = 'LD2011_2014.txt'
#raw_file = open(str(raw_file_path))

# use raw file to read csv and get raw dataframe:
raw_dataset = pd.read_csv(raw_file_path, delimiter=';', header=0, decimal=',', index_col=False, low_memory=False)

<bound method DataFrame.info of                  Unnamed: 0    MT_001     MT_002    MT_003      MT_004
0       2011-01-01 00:15:00  0.000000   0.000000  0.000000    0.000000  \
1       2011-01-01 00:30:00  0.000000   0.000000  0.000000    0.000000
2       2011-01-01 00:45:00  0.000000   0.000000  0.000000    0.000000
3       2011-01-01 01:00:00  0.000000   0.000000  0.000000    0.000000
4       2011-01-01 01:15:00  0.000000   0.000000  0.000000    0.000000
...                     ...       ...        ...       ...         ...
140251  2014-12-31 23:00:00  2.538071  22.048364  1.737619  150.406504
140252  2014-12-31 23:15:00  2.538071  21.337127  1.737619  166.666667
140253  2014-12-31 23:30:00  2.538071  20.625889  1.737619  162.601626
140254  2014-12-31 23:45:00  1.269036  21.337127  1.737619  166.666667
140255  2015-01-01 00:00:00  2.538071  19.914651  1.737619  178.861789

           MT_005      MT_006     MT_007      MT_008     MT_009  ...
0        0.000000    0.000000   0.000000    0.000000   0.000000  ...  \
1        0.000000    0.000000   0.000000    0.000000   0.000000  ...
2        0.000000    0.000000   0.000000    0.000000   0.000000  ...
3        0.000000    0.000000   0.000000    0.000000   0.000000  ...
4        0.000000    0.000000   0.000000    0.000000   0.000000  ...
...           ...         ...        ...         ...        ...  ...
140251  85.365854  303.571429  11.305822  282.828283  68.181818  ...
140252  81.707317  324.404762  11.305822  252.525253  64.685315  ...
140253  82.926829  318.452381  10.175240  242.424242  61.188811  ...
140254  85.365854  285.714286  10.175240  225.589226  64.685315  ...
140255  84.146341  279.761905  10.175240  249.158249  62.937063  ...

            MT_361   MT_362       MT_363       MT_364     MT_365    MT_366
0         0.000000      0.0     0.000000     0.000000   0.000000  0.000000  \
1         0.000000      0.0     0.000000     0.000000   0.000000  0.000000
2         0.000000      0.0     0.000000     0.000000   0.000000  0.000000
3         0.000000      0.0     0.000000     0.000000   0.000000  0.000000
4         0.000000      0.0     0.000000     0.000000   0.000000  0.000000
...            ...      ...          ...          ...        ...       ...
140251  276.945039  28200.0  1616.033755  1363.636364  29.986962  5.851375
140252  279.800143  28300.0  1569.620253  1340.909091  29.986962  9.947338
140253  284.796574  27800.0  1556.962025  1318.181818  27.379400  9.362200
140254  246.252677  28000.0  1443.037975   909.090909  26.075619  4.095963
140255  188.436831  27800.0  1409.282700   954.545455  27.379400  4.095963

            MT_367      MT_368      MT_369       MT_370
0         0.000000    0.000000    0.000000     0.000000
1         0.000000    0.000000    0.000000     0.000000
2         0.000000    0.000000    0.000000     0.000000
3         0.000000    0.000000    0.000000     0.000000
4         0.000000    0.000000    0.000000     0.000000
...            ...         ...         ...          ...
140251  697.102722  176.961603  651.026393  7621.621622
140252  671.641791  168.614357  669.354839  6702.702703
140253  670.763828  153.589316  670.087977  6864.864865
140254  664.618086  146.911519  646.627566  6540.540541
140255  628.621598  131.886477  673.020528  7135.135135

[140256 rows x 371 columns]>
<bound method NDFrame.head of                  Unnamed: 0    MT_001     MT_002    MT_003      MT_004
0       2011-01-01 00:15:00  0.000000   0.000000  0.000000    0.000000  \
1       2011-01-01 00:30:00  0.000000   0.000000  0.000000    0.000000
2       2011-01-01 00:45:00  0.000000   0.000000  0.000000    0.000000
3       2011-01-01 01:00:00  0.000000   0.000000  0.000000    0.000000
4       2011-01-01 01:15:00  0.000000   0.000000  0.000000    0.000000
...                     ...       ...        ...       ...         ...
140251  2014-12-31 23:00:00  2.538071  22.048364  1.737619  150.406504
140252  2014-12-31 23:15:00  2.538071  21.337127  1.737619  166.666667
140253  2014-12-31 23:30:00  2.538071  20.625889  1.737619  162.601626
140254  2014-12-31 23:45:00  1.269036  21.337127  1.737619  166.666667
140255  2015-01-01 00:00:00  2.538071  19.914651  1.737619  178.861789

           MT_005      MT_006     MT_007      MT_008     MT_009  ...
0        0.000000    0.000000   0.000000    0.000000   0.000000  ...  \
1        0.000000    0.000000   0.000000    0.000000   0.000000  ...
2        0.000000    0.000000   0.000000    0.000000   0.000000  ...
3        0.000000    0.000000   0.000000    0.000000   0.000000  ...
4        0.000000    0.000000   0.000000    0.000000   0.000000  ...
...           ...         ...        ...         ...        ...  ...
140251  85.365854  303.571429  11.305822  282.828283  68.181818  ...
140252  81.707317  324.404762  11.305822  252.525253  64.685315  ...
140253  82.926829  318.452381  10.175240  242.424242  61.188811  ...
140254  85.365854  285.714286  10.175240  225.589226  64.685315  ...
140255  84.146341  279.761905  10.175240  249.158249  62.937063  ...

            MT_361   MT_362       MT_363       MT_364     MT_365    MT_366
0         0.000000      0.0     0.000000     0.000000   0.000000  0.000000  \
1         0.000000      0.0     0.000000     0.000000   0.000000  0.000000
2         0.000000      0.0     0.000000     0.000000   0.000000  0.000000
3         0.000000      0.0     0.000000     0.000000   0.000000  0.000000
4         0.000000      0.0     0.000000     0.000000   0.000000  0.000000
...            ...      ...          ...          ...        ...       ...
140251  276.945039  28200.0  1616.033755  1363.636364  29.986962  5.851375
140252  279.800143  28300.0  1569.620253  1340.909091  29.986962  9.947338
140253  284.796574  27800.0  1556.962025  1318.181818  27.379400  9.362200
140254  246.252677  28000.0  1443.037975   909.090909  26.075619  4.095963
140255  188.436831  27800.0  1409.282700   954.545455  27.379400  4.095963

            MT_367      MT_368      MT_369       MT_370
0         0.000000    0.000000    0.000000     0.000000
1         0.000000    0.000000    0.000000     0.000000
2         0.000000    0.000000    0.000000     0.000000
3         0.000000    0.000000    0.000000     0.000000
4         0.000000    0.000000    0.000000     0.000000
...            ...         ...         ...          ...
140251  697.102722  176.961603  651.026393  7621.621622
140252  671.641791  168.614357  669.354839  6702.702703
140253  670.763828  153.589316  670.087977  6864.864865
140254  664.618086  146.911519  646.627566  6540.540541
140255  628.621598  131.886477  673.020528  7135.135135

[140256 rows x 371 columns]>

In [12]:
# check dataframe info and head:
print(raw_dataset.info())
print(raw_dataset.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140256 entries, 0 to 140255
Columns: 371 entries, Unnamed: 0 to MT_370
dtypes: float64(370), object(1)
memory usage: 397.0+ MB
None
            Unnamed: 0  MT_001  MT_002  MT_003  MT_004  MT_005  MT_006
0  2011-01-01 00:15:00     0.0     0.0     0.0     0.0     0.0     0.0  \
1  2011-01-01 00:30:00     0.0     0.0     0.0     0.0     0.0     0.0
2  2011-01-01 00:45:00     0.0     0.0     0.0     0.0     0.0     0.0
3  2011-01-01 01:00:00     0.0     0.0     0.0     0.0     0.0     0.0
4  2011-01-01 01:15:00     0.0     0.0     0.0     0.0     0.0     0.0

   MT_007  MT_008  MT_009  ...  MT_361  MT_362  MT_363  MT_364  MT_365
0     0.0     0.0     0.0  ...     0.0     0.0     0.0     0.0     0.0  \
1     0.0     0.0     0.0  ...     0.0     0.0     0.0     0.0     0.0
2     0.0     0.0     0.0  ...     0.0     0.0     0.0     0.0     0.0
3     0.0     0.0     0.0  ...     0.0     0.0     0.0     0.0     0.0
4     0.0     0.0     0.0  ...     0.0     0.0     0.0     0.0     0.0

   MT_366  MT_367  MT_368  MT_369  MT_370
0     0.0     0.0     0.0     0.0     0.0
1     0.0     0.0     0.0     0.0     0.0
2     0.0     0.0     0.0     0.0     0.0
3     0.0     0.0     0.0     0.0     0.0
4     0.0     0.0     0.0     0.0     0.0

[5 rows x 371 columns]

In [13]:
# since column with datetime values doesn't have name, rename it to 'datetime':
data_timecol = raw_dataset.rename(columns={'Unnamed: 0':'datetime'})

# check dtypes for dataframe:
print(data_timecol.dtypes)

# transform rennamed column into datetime dtype:
data_timecol['datetime'] = pd.to_datetime(data_timecol['datetime'], format='%Y-%m-%d %H:%M:%S')

datetime     object
MT_001      float64
MT_002      float64
MT_003      float64
MT_004      float64
             ...
MT_366      float64
MT_367      float64
MT_368      float64
MT_369      float64
MT_370      float64
Length: 371, dtype: object

In [16]:
# Count total of columns per dtypes:
print(data_timecol.dtypes.value_counts())

float64           370
datetime64[ns]      1
Name: count, dtype: int64

In [24]:
# resample data from 15min level to day level:
data_resamp = data_timecol.resample('1H', on='datetime').sum().reset_index()

# check to see if resampling went through:
print(data_resamp.head())

             datetime  MT_001  MT_002  MT_003  MT_004  MT_005  MT_006  MT_007
0 2011-01-01 00:00:00     0.0     0.0     0.0     0.0     0.0     0.0     0.0  \
1 2011-01-01 01:00:00     0.0     0.0     0.0     0.0     0.0     0.0     0.0
2 2011-01-01 02:00:00     0.0     0.0     0.0     0.0     0.0     0.0     0.0
3 2011-01-01 03:00:00     0.0     0.0     0.0     0.0     0.0     0.0     0.0
4 2011-01-01 04:00:00     0.0     0.0     0.0     0.0     0.0     0.0     0.0

   MT_008  MT_009  ...  MT_361  MT_362  MT_363  MT_364  MT_365  MT_366
0     0.0     0.0  ...     0.0     0.0     0.0     0.0     0.0     0.0  \
1     0.0     0.0  ...     0.0     0.0     0.0     0.0     0.0     0.0
2     0.0     0.0  ...     0.0     0.0     0.0     0.0     0.0     0.0
3     0.0     0.0  ...     0.0     0.0     0.0     0.0     0.0     0.0
4     0.0     0.0  ...     0.0     0.0     0.0     0.0     0.0     0.0

   MT_367  MT_368  MT_369  MT_370
0     0.0     0.0     0.0     0.0
1     0.0     0.0     0.0     0.0
2     0.0     0.0     0.0     0.0
3     0.0     0.0     0.0     0.0
4     0.0     0.0     0.0     0.0

[5 rows x 371 columns]

In [ ]:
# before going on, lets remove the 'MT_' from the column names:
# first, create a dictionary of old and new column names, with new names as integers:
#new_column_names = {col: col.replace('MT_', '') for col in resampled_data.columns if 'MT_' in col}
# next, use dictionary to rename old columns:
#resampled_data = resampled_data.rename(columns=new_column_names)

In [27]:
resampled_data = data_resamp

# stack dataset by melting it (the value_name col will be recalculated after):
melted_data = pd.melt(resampled_data, id_vars=['datetime'], var_name='client_id', value_name='KwH')
# check changes: print(melted_data.head)
# change client_id col to int:
#melted_data['client_id'] = melted_data['client_id'].astype(int)
# Remove 'MT_' from client_id col:
melted_data['client_id'] = melted_data['client_id'].str.replace('MT_', '').astype(int)
# check changes: print(melted_data.dtypes)
# check head:
print(melted_data.head())

             datetime  client_id  KwH
0 2011-01-01 00:00:00          1  0.0
1 2011-01-01 01:00:00          1  0.0
2 2011-01-01 02:00:00          1  0.0
3 2011-01-01 03:00:00          1  0.0
4 2011-01-01 04:00:00          1  0.0

In [28]:
complete_idx = pd.MultiIndex.from_product((set(melted_data.datetime), set(melted_data.client_id)))
complete_idx

MultiIndex([('2011-12-12 05:00:00',   1),
            ('2011-12-12 05:00:00',   2),
            ('2011-12-12 05:00:00',   3),
            ('2011-12-12 05:00:00',   4),
            ('2011-12-12 05:00:00',   5),
            ('2011-12-12 05:00:00',   6),
            ('2011-12-12 05:00:00',   7),
            ('2011-12-12 05:00:00',   8),
            ('2011-12-12 05:00:00',   9),
            ('2011-12-12 05:00:00',  10),
            ...
            ('2014-04-26 04:00:00', 361),
            ('2014-04-26 04:00:00', 362),
            ('2014-04-26 04:00:00', 363),
            ('2014-04-26 04:00:00', 364),
            ('2014-04-26 04:00:00', 365),
            ('2014-04-26 04:00:00', 366),
            ('2014-04-26 04:00:00', 367),
            ('2014-04-26 04:00:00', 368),
            ('2014-04-26 04:00:00', 369),
            ('2014-04-26 04:00:00', 370)],
           length=12974050)

In [55]:
all_melted_data = melted_data.set_index(['datetime','client_id']).reindex(complete_idx, fill_value=0).reset_index()
all_melted_data.columns = ['datetime','client_id','KwH']
all_melted_data = all_melted_data.sort_values(['client_id','datetime'])
all_melted_data.head()

                    datetime  client_id  KwH
7967210  2011-01-01 00:00:00          1  0.0
10964950 2011-01-01 01:00:00          1  0.0
1776000  2011-01-01 02:00:00          1  0.0
3534240  2011-01-01 03:00:00          1  0.0
4898800  2011-01-01 04:00:00          1  0.0

In [49]:
cutoff_dates = all_melted_data[all_melted_data['KwH'] != 0].groupby('client_id', as_index=False).agg(
    min=('datetime','min'),
    max=('datetime','max')
    )

cutoff_dates.tail()

     client_id        min        max
365        366 2012-01-01 2015-01-01
366        367 2012-01-01 2015-01-01
367        368 2012-01-01 2015-01-01
368        369 2012-01-01 2015-01-01
369        370 2013-01-01 2015-01-01

In [ ]:
# remove dates before first and after last nonzero info for each client:
for _, row in cutoff_dates.iterrows():
    client_id = row['client_id']
    start_date = row['min']
    end_date = row['max']
    all_melted_data.drop(all_melted_data[all_melted_data.client_id == client_id][all_melted_data.datetime < start_date].index, inplace=True)
    all_melted_data.drop(all_melted_data[all_melted_data.client_id == client_id][all_melted_data.datetime > end_date].index, inplace=True)

In [56]:
all_melted_data.head()

                    datetime  client_id  KwH
7967210  2011-01-01 00:00:00          1  0.0
10964950 2011-01-01 01:00:00          1  0.0
1776000  2011-01-01 02:00:00          1  0.0
3534240  2011-01-01 03:00:00          1  0.0
4898800  2011-01-01 04:00:00          1  0.0

In [59]:
tmp = all_melted_data.copy()

def filter_rows_before_after_date(df, cutoff_dates):
    df = df.merge(cutoff_dates, on='client_id', how='left')
    df['is_before_start'] = df['datetime'] < df['min']
    df['is_after_end'] = df['datetime'] > df['max']
    df.drop(df[df.is_before_start == True].index, inplace=True)
    df.drop(df[df.is_after_end == True].index, inplace=True)
    df.drop(['is_before_start', 'is_after_end', 'min', 'max'], axis=1, inplace=True)
    return df

all_melted_data = filter_rows_before_after_date(all_melted_data, cutoff_dates)
all_melted_data.head()

                datetime  client_id        KwH
8760 2012-01-01 00:00:00          1  12.690355
8761 2012-01-01 01:00:00          1  16.497462
8762 2012-01-01 02:00:00          1  19.035533
8763 2012-01-01 03:00:00          1  17.766497
8764 2012-01-01 04:00:00          1  19.035533